# Задача 1
# a = int(input('Введите число от 0 до 10'))
# while a<0 or a>10:
#     print ('Не верное число')
#     a = int(input('Введите число от 0 до 10'))
# else:
#     a = a ** 2
#     print(a)

# Задача 2
# a = int(input('Введи число A:'))
# b = int(input('Ввеи число B:'))
# a = a + b
# b = a - b
# a = -(b - a)
# print(a, b)



